# Introduction to Pandas

In [ ]:
# Pandas methods:
# load csv into dataframe: pd.read_csv('my-csv-file.csv')
# save data to csv: df.to_csv('new-csv-file.csv')
# gives some statistics for each column: df.info()
# gives the first 5 rows of a DataFrame: df.head()
# select column: dfname['dfcolumnname'] or dfname.dfcolumnname

## Series and DataFrames (lesson 3.1)

In [149]:
import numpy as np
import pandas as pd
# from pandas import Series, DataFrame

In [150]:
x = Series([30,40,50])
x

0    30
1    40
2    50
dtype: int64

In [151]:
x.values

array([30, 40, 50])

In [152]:
x.index

RangeIndex(start=0, stop=3, step=1)

In [153]:
# create Series with index

In [154]:
sales = Series([45000,65000,87000],index=['Don','Mike','Edwin'])
sales

Don      45000
Mike     65000
Edwin    87000
dtype: int64

In [155]:
type(sales)

pandas.core.series.Series

In [156]:
# check a specific value

In [157]:
sales['Don']

45000

In [158]:
# check for conditions

In [159]:
sales[sales>50000]

Mike     65000
Edwin    87000
dtype: int64

In [160]:
# check for value existence

In [161]:
'Don' in sales

True

In [162]:
'John' in sales

False

In [163]:
# convert Series to a dictionary

In [164]:
sales_dict = sales.to_dict()
sales_dict

{'Don': 45000, 'Mike': 65000, 'Edwin': 87000}

In [165]:
# convert dictionary to Series

In [166]:
sales_series = Series(sales_dict)
sales_series

Don      45000
Mike     65000
Edwin    87000
dtype: int64

In [167]:
# add index to Series

In [168]:
new = ['Don','Mike','Edwin','John']
sales_new = Series(sales_dict,index=new)
sales_new

Don      45000.0
Mike     65000.0
Edwin    87000.0
John         NaN
dtype: float64

In [169]:
# find Null values

In [170]:
pd.isnull(sales_new) # can also be: sales_new.isna()

Don      False
Mike     False
Edwin    False
John      True
dtype: bool

In [171]:
# sum value in Series

In [172]:
sales_new + sales_new

Don       90000.0
Mike     130000.0
Edwin    174000.0
John          NaN
dtype: float64

In [173]:
# name a Series

In [174]:
sales_new.name = 'Total Sales'
sales_new

Don      45000.0
Mike     65000.0
Edwin    87000.0
John         NaN
Name: Total Sales, dtype: float64

In [175]:
sales_new.index.name = 'Sales Person'
sales_new

Sales Person
Don      45000.0
Mike     65000.0
Edwin    87000.0
John         NaN
Name: Total Sales, dtype: float64

## Creating a DataFrame (lesson 3.2)

In [176]:
# create DataFrame from list (similar to an Excel worksheet)

In [177]:
age_data = [['Adrian',20.5],['Beatrice',32.9],['Chloe',41.1]]
age_data
# can also add data using lists
# a list of lists can be passed, where each one represents a row of data

[['Adrian', 20.5], ['Beatrice', 32.9], ['Chloe', 41.1]]

In [178]:
int_df = pd.DataFrame(age_data,columns=['Name','Age'],dtype=int) # int does not work not sure why
int_df
# use keyword argument 'columns' to pass a list of column names

       Name   Age
0    Adrian  20.5
1  Beatrice  32.9
2     Chloe  41.1

In [179]:
float_df = pd.DataFrame(age_data,columns=['Name','Age'],dtype=float)
float_df

       Name   Age
0    Adrian  20.5
1  Beatrice  32.9
2     Chloe  41.1

In [180]:
# create a DataFrame from dictionary using default index

In [181]:
sales_dict = {'Name':['Tom','Jack','Steve','Ricky'],'Sales':[25000,30000,35000,40000]}
pd.DataFrame(sales_dict)
# a dictionary can be passed into pd.DataFrame()
# each key is a column name and each value is a list of column values
# columns must all be the same length or you will get an error

    Name  Sales
0    Tom  25000
1   Jack  30000
2  Steve  35000
3  Ricky  40000

In [182]:
# create a DataFrame from dictionary by applying value for index

In [183]:
sales_dict = {'Name':['Tom','Jack','Steve','Ricky'],'Sales':[25000,30000,35000,40000]}
pd.DataFrame(sales_dict,index=['rank1','rank2','rank3','rank4']) # all four index names required

        Name  Sales
rank1    Tom  25000
rank2   Jack  30000
rank3  Steve  35000
rank4  Ricky  40000

In [184]:
# create a DataFrame from dictionary without passing index value

In [185]:
test_list_dict = [{'one':1,'two':2},{'one':5,'two':10,'three':15}]
pd.DataFrame(test_list_dict)

   one  two  three
0    1    2    NaN
1    5   10   15.0

In [186]:
pd.DataFrame(test_list_dict,columns=['one','two']) # stating columns limit columns shown

   one  two
0    1    2
1    5   10

In [187]:
# create a DataFrame from dictionary by passing index value

In [188]:
test2_list_dict = [{'East':15000,'West':20000},{'East':5000,'West':10500,'South':20000}]
pd.DataFrame(test2_list_dict,index=['Sales1','Sales2'],columns=['East','West'])

         East   West
Sales1  15000  20000
Sales2   5000  10500

In [189]:
pd.DataFrame(test2_list_dict,index=['Sales1','Sales2'],columns=['East','South'])

         East    South
Sales1  15000      NaN
Sales2   5000  20000.0

In [190]:
# create a DataFrame from dictionary of Series

In [191]:
sales = {'East': pd.Series([10000,20000,30000],index=['Q1','Q2','Q3']),
        'West':pd.Series([15000,25000,35000,45000],index=['Q1','Q2','Q3','Q4'])}
sales_df = pd.DataFrame(sales)
sales_df

       East   West
Q1  10000.0  15000
Q2  20000.0  25000
Q3  30000.0  35000
Q4      NaN  45000

In [192]:
# adding columns to DataFrame

In [193]:
sales_df['South']=pd.Series([17000,27000,37000],index=['Q1','Q2','Q3'])
sales_df

       East   West    South
Q1  10000.0  15000  17000.0
Q2  20000.0  25000  27000.0
Q3  30000.0  35000  37000.0
Q4      NaN  45000      NaN

In [194]:
# sum values in DataFrame

In [195]:
sales_df['E+W']=sales_df['East']+sales_df['West']
sales_df

       East   West    South      E+W
Q1  10000.0  15000  17000.0  25000.0
Q2  20000.0  25000  27000.0  45000.0
Q3  30000.0  35000  37000.0  65000.0
Q4      NaN  45000      NaN      NaN

## Index and reindex objects (lesson 3.3)

In [196]:
income = Series([45000,65000,87000],index=['Don','Mike','Edwin'])
income

Don      45000
Mike     65000
Edwin    87000
dtype: int64

In [197]:
income.reindex(['Don','Luke','Edwin'])

Don      45000.0
Luke         NaN
Edwin    87000.0
dtype: float64

In [198]:
# replacing Null values with zeroes

In [199]:
income.reindex(['Don','Luke','Edwin'],fill_value=0)

Don      45000
Luke         0
Edwin    87000
dtype: int64

In [200]:
# indexing and reindexing DataFrames

In [201]:
report = {'County':['Croydon','Cornwall','Hampshire'],
          'Year':[2011,2012,2013],
          'Sales':[20000,35000,45000]}
report_df = pd.DataFrame(report)
report_df

      County  Year  Sales
0    Croydon  2011  20000
1   Cornwall  2012  35000
2  Hampshire  2013  45000

In [202]:
report_df.reindex([2,1,0])

      County  Year  Sales
2  Hampshire  2013  45000
1   Cornwall  2012  35000
0    Croydon  2011  20000

In [203]:
# cannot reindex using random values

In [204]:
report_df.reindex([20,30,40])

   County  Year  Sales
20    NaN   NaN    NaN
30    NaN   NaN    NaN
40    NaN   NaN    NaN

In [205]:
# change column order

In [206]:
column_titles=['Year','Sales','County'] # case sensitive
report_df.reindex(columns=column_titles)

   Year  Sales     County
0  2011  20000    Croydon
1  2012  35000   Cornwall
2  2013  45000  Hampshire

In [207]:
# drop index in Series

In [208]:
ser1 = Series(np.arange(3),index=('aa','bb','cc'))
ser1

aa    0
bb    1
cc    2
dtype: int64

In [209]:
ser1.drop('cc')

aa    0
bb    1
dtype: int64

In [210]:
# drop index in DataFrame

In [211]:
sales_df = DataFrame(np.arange(9).reshape(3,3),index=['SF','NYC','BO'],columns=['Q1','Q2','Q3'])
sales_df

     Q1  Q2  Q3
SF    0   1   2
NYC   3   4   5
BO    6   7   8

In [212]:
sales_df.drop('NYC')

    Q1  Q2  Q3
SF   0   1   2
BO   6   7   8

## Selecting entries (lesson 3.4)

In [213]:
ser1 = Series(np.arange(3),index=['AA','BB','CC'])
ser1

AA    0
BB    1
CC    2
dtype: int64

In [214]:
ser1 = 2*ser1
ser1

AA    0
BB    2
CC    4
dtype: int64

In [215]:
ser1['BB']

2

In [216]:
ser1[1]

2

In [217]:
ser1[0:3]

AA    0
BB    2
CC    4
dtype: int64

In [218]:
ser1[['AA','BB']]

AA    0
BB    2
dtype: int64

In [219]:
ser1[ser1>2]

CC    4
dtype: int64

In [220]:
ser1[ser1>2]=20
ser1

AA     0
BB     2
CC    20
dtype: int64

In [221]:
# select entries in DataFrame

In [222]:
sales_data = {'County': ['Croydon', 'Cornwall', 'Cumbria', 'Durham','Hampshire'],
        'Year': ['2012', '2012', '2013', '2014', '2014'],
        'Sales': [45000, 24000, 31000, 20000, 30000]}
sales_df = pd.DataFrame(sales_data)
sales_df

      County  Year  Sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [223]:
# extract from a specific location

In [224]:
sales_df.iloc[2,2]

31000

In [225]:
# extract from a specific column

In [226]:
sales_df['Year']

0    2012
1    2012
2    2013
3    2014
4    2014
Name: Year, dtype: object

In [227]:
# extract more than one column

In [228]:
sales_df[['Year','Sales']]

   Year  Sales
0  2012  45000
1  2012  24000
2  2013  31000
3  2014  20000
4  2014  30000

In [229]:
# check for values in DataFrame

In [230]:
sales_df[sales_df['Sales']>24000]

      County  Year  Sales
0    Croydon  2012  45000
2    Cumbria  2013  31000
4  Hampshire  2014  30000

In [231]:
# apply Boolean to DataFrame

In [232]:
sales_df['Sales']>24000

0     True
1    False
2     True
3    False
4     True
Name: Sales, dtype: bool

In [233]:
sales_df.loc[2]

County    Cumbria
Year         2013
Sales       31000
Name: 2, dtype: object